httpbin-test-2.yml
#Spróbuj samodzielnie zmienić wartość duration i/lub arrivalRate, uruchomić test jeszcze raz i popatrzeć na zmiany w danych raportowych

config:
  target: "http://httpbin.org/"
  phases:
    - duration: 7
      arrivalRate: 2
      name: Artillery Second Test
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
      - log: "Json value from response is: {{request_body}}"
      - log: "Host value from response is: {{host}}"