httpbin-test-5.yml
#This test uses payload from csv file
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Artillery Payload Test from CSV file
  payload:
    - path: "keywords.csv"
      fields:
        - "keyword1"
        - "keyword2"
      order: sequence
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get?param1={{ keyword1 }}"
      - post:
          url: "{{ target }}post?param2={{ keyword2 }}"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.origin"
              as: "origin"