httpbin-test-7.yml
#This test users processors
config:
  target: "http://httpbin.org/"
  processor: "processor.js"
  phases:
    - duration: 1
      arrivalRate: 1
      name: File upload
scenarios:
  - name: Uploading a file
    flow:
      - post:
          url: "{{ target }}anything"
          beforeRequest: "setupMultipartFromData"